# IsTextTypeIdValid Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayStyle..::..IsTextTypeIdValid Method
AnalysisDisplayStyle Class See Also
---
Verify if text type id is valid.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static bool IsTextTypeIdValid(
	ElementId textTypeId,
	Document doc
)
```

Visual Basic
---
```text
Public Shared Function IsTextTypeIdValid ( _
	textTypeId As ElementId, _
	doc As Document _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsTextTypeIdValid(
	ElementId^ textTypeId,
	Document^ doc
)
```

# ### Parameters
textTypeId
    Type: Autodesk.Revit.DB..::..ElementId Text type id to be validated.
doc
    Type: Autodesk.Revit.DB..::..Document Document for which %textTypeId% is validated.
# ### Return Value
True if text type id is valid, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace